#!/usr/bin/env python
# -*- coding: UTF-8 -*-


'''
Name： NetPanelAnalysis
Function: 计算环形网片顶破力、顶破位移、耗能能力
Note: 国际单位制
Version: 1.2.1
Author: Liping GUO
Date: from 2021/8/31 to 
命名方式：以平行于x方向及y方向分别作为后缀
Remark: 影响计算结果的细节因素：
	(1)直线传力纤维与变形后的环网曲面传力路径之间的角度差异 1.5F; 
	(2)三环环链拉伸代表了一种网环受力的最不利情形，实际网片中传力路径上环网轴向应力发展程度可能高于环链试验值+0.18
	(3)需保证夹持卡扣的强度，一旦卡扣强度不足，将发生钢丝滑移失效，造成网片承载力下降。
	(4) 该版本修正了一个错误：对应网环顶破试验，R3/2.2/300其实为R4/2.2/300，而R4/2.2/300其实为R4/3.0/300。
	(5)由于(3)中的原因，剔除了网片试验RN3对应的试验结果，只保留R4/3.0/300的试验结果
	(6)由于(3)中的原因，对于直径为2.2mm钢丝对应的网片规格R4/2.2/300，进行了单独计算
	(7)Bug: gamma_N2的拟合结果与FN2的拟合结果存在不一致情况
	(8)弹簧-纤维单元的双线性刚度特征，导致F_2及E_2在计算时每个单元分别修正与单元不同阶段实际刚度一致
	(9)钢柱摆动、残余高度、窗帘效应
'''

import numpy as np
from userfunc_NPA import *

# 参数输入----------------------------------------------------------------------------------- #
if __name__ == '__main__':

	w = 3.0
	Rp = 0.5  # 加载顶头水平投影半径，若加载形状为多边形时考虑为半径为Rp圆内切
	a = 0.3
	m = 2*func_round(Rp/a)
	i_arr = np.arange(1,m+0.1,step=1)
	xP_arr = a/2*(i_arr - (m+1)/2)
	yP_arr = np.sqrt(Rp**2 - xP_arr**2)
	zP_arr = np.zeros_like(xP_arr)

	theta = 0

	theta_1 = np.arcsin(xP_arr[-1]/(w/np.sqrt(2)))
	m1 = m/2 - 1/2*func_round(np.sqrt(2)*w*np.sin(theta)/a)
	m2 = m - m1
